espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** TEE_DMA_DATE_REG register
 *  NA
 */
#define TEE_DMA_DATE_REG (DR_REG_TEE_DMA_BASE + 0x0)
/** TEE_DMA_TEE_DATE : R/W; bitpos: [31:0]; default: 539165460;
 *  NA
 */
#define TEE_DMA_TEE_DATE    0xFFFFFFFFU
#define TEE_DMA_TEE_DATE_M  (TEE_DMA_TEE_DATE_V << TEE_DMA_TEE_DATE_S)
#define TEE_DMA_TEE_DATE_V  0xFFFFFFFFU
#define TEE_DMA_TEE_DATE_S  0

/** TEE_DMA_CLK_EN_REG register
 *  NA
 */
#define TEE_DMA_CLK_EN_REG (DR_REG_TEE_DMA_BASE + 0x4)
/** TEE_DMA_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define TEE_DMA_CLK_EN    (BIT(0))
#define TEE_DMA_CLK_EN_M  (TEE_DMA_CLK_EN_V << TEE_DMA_CLK_EN_S)
#define TEE_DMA_CLK_EN_V  0x00000001U
#define TEE_DMA_CLK_EN_S  0

/** TEE_DMA_REGION0_LOW_REG register
 *  Region0 address low register.
 */
#define TEE_DMA_REGION0_LOW_REG (DR_REG_TEE_DMA_BASE + 0x8)
/** TEE_DMA_REGION0_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region0 address low.
 */
#define TEE_DMA_REGION0_LOW    0x000FFFFFU
#define TEE_DMA_REGION0_LOW_M  (TEE_DMA_REGION0_LOW_V << TEE_DMA_REGION0_LOW_S)
#define TEE_DMA_REGION0_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION0_LOW_S  12

/** TEE_DMA_REGION0_HIGH_REG register
 *  Region0 address high register.
 */
#define TEE_DMA_REGION0_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xc)
/** TEE_DMA_REGION0_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region0 address high.
 */
#define TEE_DMA_REGION0_HIGH    0x000FFFFFU
#define TEE_DMA_REGION0_HIGH_M  (TEE_DMA_REGION0_HIGH_V << TEE_DMA_REGION0_HIGH_S)
#define TEE_DMA_REGION0_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION0_HIGH_S  12

/** TEE_DMA_REGION1_LOW_REG register
 *  Region1 address low register.
 */
#define TEE_DMA_REGION1_LOW_REG (DR_REG_TEE_DMA_BASE + 0x10)
/** TEE_DMA_REGION1_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region1 address low.
 */
#define TEE_DMA_REGION1_LOW    0x000FFFFFU
#define TEE_DMA_REGION1_LOW_M  (TEE_DMA_REGION1_LOW_V << TEE_DMA_REGION1_LOW_S)
#define TEE_DMA_REGION1_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION1_LOW_S  12

/** TEE_DMA_REGION1_HIGH_REG register
 *  Region1 address high register.
 */
#define TEE_DMA_REGION1_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x14)
/** TEE_DMA_REGION1_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region1 address high.
 */
#define TEE_DMA_REGION1_HIGH    0x000FFFFFU
#define TEE_DMA_REGION1_HIGH_M  (TEE_DMA_REGION1_HIGH_V << TEE_DMA_REGION1_HIGH_S)
#define TEE_DMA_REGION1_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION1_HIGH_S  12

/** TEE_DMA_REGION2_LOW_REG register
 *  Region2 address low register.
 */
#define TEE_DMA_REGION2_LOW_REG (DR_REG_TEE_DMA_BASE + 0x18)
/** TEE_DMA_REGION2_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region2 address low.
 */
#define TEE_DMA_REGION2_LOW    0x000FFFFFU
#define TEE_DMA_REGION2_LOW_M  (TEE_DMA_REGION2_LOW_V << TEE_DMA_REGION2_LOW_S)
#define TEE_DMA_REGION2_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION2_LOW_S  12

/** TEE_DMA_REGION2_HIGH_REG register
 *  Region2 address high register.
 */
#define TEE_DMA_REGION2_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x1c)
/** TEE_DMA_REGION2_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region2 address high.
 */
#define TEE_DMA_REGION2_HIGH    0x000FFFFFU
#define TEE_DMA_REGION2_HIGH_M  (TEE_DMA_REGION2_HIGH_V << TEE_DMA_REGION2_HIGH_S)
#define TEE_DMA_REGION2_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION2_HIGH_S  12

/** TEE_DMA_REGION3_LOW_REG register
 *  Region3 address low register.
 */
#define TEE_DMA_REGION3_LOW_REG (DR_REG_TEE_DMA_BASE + 0x20)
/** TEE_DMA_REGION3_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region3 address low.
 */
#define TEE_DMA_REGION3_LOW    0x000FFFFFU
#define TEE_DMA_REGION3_LOW_M  (TEE_DMA_REGION3_LOW_V << TEE_DMA_REGION3_LOW_S)
#define TEE_DMA_REGION3_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION3_LOW_S  12

/** TEE_DMA_REGION3_HIGH_REG register
 *  Region3 address high register.
 */
#define TEE_DMA_REGION3_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x24)
/** TEE_DMA_REGION3_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region3 address high.
 */
#define TEE_DMA_REGION3_HIGH    0x000FFFFFU
#define TEE_DMA_REGION3_HIGH_M  (TEE_DMA_REGION3_HIGH_V << TEE_DMA_REGION3_HIGH_S)
#define TEE_DMA_REGION3_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION3_HIGH_S  12

/** TEE_DMA_REGION4_LOW_REG register
 *  Region4 address low register.
 */
#define TEE_DMA_REGION4_LOW_REG (DR_REG_TEE_DMA_BASE + 0x28)
/** TEE_DMA_REGION4_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region4 address low.
 */
#define TEE_DMA_REGION4_LOW    0x000FFFFFU
#define TEE_DMA_REGION4_LOW_M  (TEE_DMA_REGION4_LOW_V << TEE_DMA_REGION4_LOW_S)
#define TEE_DMA_REGION4_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION4_LOW_S  12

/** TEE_DMA_REGION4_HIGH_REG register
 *  Region4 address high register.
 */
#define TEE_DMA_REGION4_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x2c)
/** TEE_DMA_REGION4_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region4 address high.
 */
#define TEE_DMA_REGION4_HIGH    0x000FFFFFU
#define TEE_DMA_REGION4_HIGH_M  (TEE_DMA_REGION4_HIGH_V << TEE_DMA_REGION4_HIGH_S)
#define TEE_DMA_REGION4_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION4_HIGH_S  12

/** TEE_DMA_REGION5_LOW_REG register
 *  Region5 address low register.
 */
#define TEE_DMA_REGION5_LOW_REG (DR_REG_TEE_DMA_BASE + 0x30)
/** TEE_DMA_REGION5_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region5 address low.
 */
#define TEE_DMA_REGION5_LOW    0x000FFFFFU
#define TEE_DMA_REGION5_LOW_M  (TEE_DMA_REGION5_LOW_V << TEE_DMA_REGION5_LOW_S)
#define TEE_DMA_REGION5_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION5_LOW_S  12

/** TEE_DMA_REGION5_HIGH_REG register
 *  Region5 address high register.
 */
#define TEE_DMA_REGION5_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x34)
/** TEE_DMA_REGION5_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region5 address high.
 */
#define TEE_DMA_REGION5_HIGH    0x000FFFFFU
#define TEE_DMA_REGION5_HIGH_M  (TEE_DMA_REGION5_HIGH_V << TEE_DMA_REGION5_HIGH_S)
#define TEE_DMA_REGION5_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION5_HIGH_S  12

