espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_REGION6_LOW_REG register
 *  Region6 address low register.
 */
#define TEE_DMA_REGION6_LOW_REG (DR_REG_TEE_DMA_BASE + 0x38)
/** TEE_DMA_REGION6_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region6 address low.
 */
#define TEE_DMA_REGION6_LOW    0x000FFFFFU
#define TEE_DMA_REGION6_LOW_M  (TEE_DMA_REGION6_LOW_V << TEE_DMA_REGION6_LOW_S)
#define TEE_DMA_REGION6_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION6_LOW_S  12

/** TEE_DMA_REGION6_HIGH_REG register
 *  Region6 address high register.
 */
#define TEE_DMA_REGION6_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x3c)
/** TEE_DMA_REGION6_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region6 address high.
 */
#define TEE_DMA_REGION6_HIGH    0x000FFFFFU
#define TEE_DMA_REGION6_HIGH_M  (TEE_DMA_REGION6_HIGH_V << TEE_DMA_REGION6_HIGH_S)
#define TEE_DMA_REGION6_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION6_HIGH_S  12

/** TEE_DMA_REGION7_LOW_REG register
 *  Region7 address low register.
 */
#define TEE_DMA_REGION7_LOW_REG (DR_REG_TEE_DMA_BASE + 0x40)
/** TEE_DMA_REGION7_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region7 address low.
 */
#define TEE_DMA_REGION7_LOW    0x000FFFFFU
#define TEE_DMA_REGION7_LOW_M  (TEE_DMA_REGION7_LOW_V << TEE_DMA_REGION7_LOW_S)
#define TEE_DMA_REGION7_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION7_LOW_S  12

/** TEE_DMA_REGION7_HIGH_REG register
 *  Region7 address high register.
 */
#define TEE_DMA_REGION7_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x44)
/** TEE_DMA_REGION7_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region7 address high.
 */
#define TEE_DMA_REGION7_HIGH    0x000FFFFFU
#define TEE_DMA_REGION7_HIGH_M  (TEE_DMA_REGION7_HIGH_V << TEE_DMA_REGION7_HIGH_S)
#define TEE_DMA_REGION7_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION7_HIGH_S  12

/** TEE_DMA_REGION8_LOW_REG register
 *  Region8 address low register.
 */
#define TEE_DMA_REGION8_LOW_REG (DR_REG_TEE_DMA_BASE + 0x48)
/** TEE_DMA_REGION8_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region8 address low.
 */
#define TEE_DMA_REGION8_LOW    0x000FFFFFU
#define TEE_DMA_REGION8_LOW_M  (TEE_DMA_REGION8_LOW_V << TEE_DMA_REGION8_LOW_S)
#define TEE_DMA_REGION8_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION8_LOW_S  12

/** TEE_DMA_REGION8_HIGH_REG register
 *  Region8 address high register.
 */
#define TEE_DMA_REGION8_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x4c)
/** TEE_DMA_REGION8_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region8 address high.
 */
#define TEE_DMA_REGION8_HIGH    0x000FFFFFU
#define TEE_DMA_REGION8_HIGH_M  (TEE_DMA_REGION8_HIGH_V << TEE_DMA_REGION8_HIGH_S)
#define TEE_DMA_REGION8_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION8_HIGH_S  12

/** TEE_DMA_REGION9_LOW_REG register
 *  Region9 address low register.
 */
#define TEE_DMA_REGION9_LOW_REG (DR_REG_TEE_DMA_BASE + 0x50)
/** TEE_DMA_REGION9_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region9 address low.
 */
#define TEE_DMA_REGION9_LOW    0x000FFFFFU
#define TEE_DMA_REGION9_LOW_M  (TEE_DMA_REGION9_LOW_V << TEE_DMA_REGION9_LOW_S)
#define TEE_DMA_REGION9_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION9_LOW_S  12

/** TEE_DMA_REGION9_HIGH_REG register
 *  Region9 address high register.
 */
#define TEE_DMA_REGION9_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x54)
/** TEE_DMA_REGION9_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region9 address high.
 */
#define TEE_DMA_REGION9_HIGH    0x000FFFFFU
#define TEE_DMA_REGION9_HIGH_M  (TEE_DMA_REGION9_HIGH_V << TEE_DMA_REGION9_HIGH_S)
#define TEE_DMA_REGION9_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION9_HIGH_S  12

/** TEE_DMA_REGION10_LOW_REG register
 *  Region10 address low register.
 */
#define TEE_DMA_REGION10_LOW_REG (DR_REG_TEE_DMA_BASE + 0x58)
/** TEE_DMA_REGION10_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region10 address low.
 */
#define TEE_DMA_REGION10_LOW    0x000FFFFFU
#define TEE_DMA_REGION10_LOW_M  (TEE_DMA_REGION10_LOW_V << TEE_DMA_REGION10_LOW_S)
#define TEE_DMA_REGION10_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION10_LOW_S  12

/** TEE_DMA_REGION10_HIGH_REG register
 *  Region10 address high register.
 */
#define TEE_DMA_REGION10_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x5c)
/** TEE_DMA_REGION10_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region10 address high.
 */
#define TEE_DMA_REGION10_HIGH    0x000FFFFFU
#define TEE_DMA_REGION10_HIGH_M  (TEE_DMA_REGION10_HIGH_V << TEE_DMA_REGION10_HIGH_S)
#define TEE_DMA_REGION10_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION10_HIGH_S  12

/** TEE_DMA_REGION11_LOW_REG register
 *  Region11 address low register.
 */
#define TEE_DMA_REGION11_LOW_REG (DR_REG_TEE_DMA_BASE + 0x60)
/** TEE_DMA_REGION11_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region11 address low.
 */
#define TEE_DMA_REGION11_LOW    0x000FFFFFU
#define TEE_DMA_REGION11_LOW_M  (TEE_DMA_REGION11_LOW_V << TEE_DMA_REGION11_LOW_S)
#define TEE_DMA_REGION11_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION11_LOW_S  12

/** TEE_DMA_REGION11_HIGH_REG register
 *  Region11 address high register.
 */
#define TEE_DMA_REGION11_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x64)
/** TEE_DMA_REGION11_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region11 address high.
 */
#define TEE_DMA_REGION11_HIGH    0x000FFFFFU
#define TEE_DMA_REGION11_HIGH_M  (TEE_DMA_REGION11_HIGH_V << TEE_DMA_REGION11_HIGH_S)
#define TEE_DMA_REGION11_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION11_HIGH_S  12

/** TEE_DMA_REGION12_LOW_REG register
 *  Region12 address low register.
 */
#define TEE_DMA_REGION12_LOW_REG (DR_REG_TEE_DMA_BASE + 0x68)
/** TEE_DMA_REGION12_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region12 address low.
 */
#define TEE_DMA_REGION12_LOW    0x000FFFFFU
#define TEE_DMA_REGION12_LOW_M  (TEE_DMA_REGION12_LOW_V << TEE_DMA_REGION12_LOW_S)
#define TEE_DMA_REGION12_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION12_LOW_S  12

/** TEE_DMA_REGION12_HIGH_REG register
 *  Region12 address high register.
 */
#define TEE_DMA_REGION12_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x6c)
/** TEE_DMA_REGION12_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region12 address high.
 */
#define TEE_DMA_REGION12_HIGH    0x000FFFFFU
#define TEE_DMA_REGION12_HIGH_M  (TEE_DMA_REGION12_HIGH_V << TEE_DMA_REGION12_HIGH_S)
#define TEE_DMA_REGION12_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION12_HIGH_S  12

/** TEE_DMA_REGION13_LOW_REG register
 *  Region13 address low register.
 */
#define TEE_DMA_REGION13_LOW_REG (DR_REG_TEE_DMA_BASE + 0x70)
/** TEE_DMA_REGION13_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region13 address low.
 */
#define TEE_DMA_REGION13_LOW    0x000FFFFFU
#define TEE_DMA_REGION13_LOW_M  (TEE_DMA_REGION13_LOW_V << TEE_DMA_REGION13_LOW_S)
#define TEE_DMA_REGION13_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION13_LOW_S  12

/** TEE_DMA_REGION13_HIGH_REG register
 *  Region13 address high register.
 */
#define TEE_DMA_REGION13_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x74)
/** TEE_DMA_REGION13_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region13 address high.
 */
#define TEE_DMA_REGION13_HIGH    0x000FFFFFU
#define TEE_DMA_REGION13_HIGH_M  (TEE_DMA_REGION13_HIGH_V << TEE_DMA_REGION13_HIGH_S)
#define TEE_DMA_REGION13_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION13_HIGH_S  12

/** TEE_DMA_REGION14_LOW_REG register
 *  Region14 address low register.
 */
#define TEE_DMA_REGION14_LOW_REG (DR_REG_TEE_DMA_BASE + 0x78)
/** TEE_DMA_REGION14_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region14 address low.
 */
#define TEE_DMA_REGION14_LOW    0x000FFFFFU
#define TEE_DMA_REGION14_LOW_M  (TEE_DMA_REGION14_LOW_V << TEE_DMA_REGION14_LOW_S)
#define TEE_DMA_REGION14_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION14_LOW_S  12

/** TEE_DMA_REGION14_HIGH_REG register
 *  Region14 address high register.
 */
#define TEE_DMA_REGION14_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x7c)
/** TEE_DMA_REGION14_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region14 address high.
 */
#define TEE_DMA_REGION14_HIGH    0x000FFFFFU
#define TEE_DMA_REGION14_HIGH_M  (TEE_DMA_REGION14_HIGH_V << TEE_DMA_REGION14_HIGH_S)
#define TEE_DMA_REGION14_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION14_HIGH_S  12

/** TEE_DMA_REGION15_LOW_REG register
 *  Region15 address low register.
 */
#define TEE_DMA_REGION15_LOW_REG (DR_REG_TEE_DMA_BASE + 0x80)
/** TEE_DMA_REGION15_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region15 address low.
 */
#define TEE_DMA_REGION15_LOW    0x000FFFFFU
#define TEE_DMA_REGION15_LOW_M  (TEE_DMA_REGION15_LOW_V << TEE_DMA_REGION15_LOW_S)
#define TEE_DMA_REGION15_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION15_LOW_S  12

/** TEE_DMA_REGION15_HIGH_REG register
 *  Region15 address high register.
 */
#define TEE_DMA_REGION15_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x84)
/** TEE_DMA_REGION15_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region15 address high.
 */
#define TEE_DMA_REGION15_HIGH    0x000FFFFFU
#define TEE_DMA_REGION15_HIGH_M  (TEE_DMA_REGION15_HIGH_V << TEE_DMA_REGION15_HIGH_S)
#define TEE_DMA_REGION15_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION15_HIGH_S  12

/** TEE_DMA_REGION16_LOW_REG register
 *  Region16 address low register.
 */
#define TEE_DMA_REGION16_LOW_REG (DR_REG_TEE_DMA_BASE + 0x88)
/** TEE_DMA_REGION16_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region16 address low.
 */
#define TEE_DMA_REGION16_LOW    0x000FFFFFU
#define TEE_DMA_REGION16_LOW_M  (TEE_DMA_REGION16_LOW_V << TEE_DMA_REGION16_LOW_S)
#define TEE_DMA_REGION16_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION16_LOW_S  12

