espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_REGION16_HIGH_REG register
 *  Region16 address high register.
 */
#define TEE_DMA_REGION16_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x8c)
/** TEE_DMA_REGION16_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region16 address high.
 */
#define TEE_DMA_REGION16_HIGH    0x000FFFFFU
#define TEE_DMA_REGION16_HIGH_M  (TEE_DMA_REGION16_HIGH_V << TEE_DMA_REGION16_HIGH_S)
#define TEE_DMA_REGION16_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION16_HIGH_S  12

/** TEE_DMA_REGION17_LOW_REG register
 *  Region17 address low register.
 */
#define TEE_DMA_REGION17_LOW_REG (DR_REG_TEE_DMA_BASE + 0x90)
/** TEE_DMA_REGION17_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region17 address low.
 */
#define TEE_DMA_REGION17_LOW    0x000FFFFFU
#define TEE_DMA_REGION17_LOW_M  (TEE_DMA_REGION17_LOW_V << TEE_DMA_REGION17_LOW_S)
#define TEE_DMA_REGION17_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION17_LOW_S  12

/** TEE_DMA_REGION17_HIGH_REG register
 *  Region17 address high register.
 */
#define TEE_DMA_REGION17_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x94)
/** TEE_DMA_REGION17_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region17 address high.
 */
#define TEE_DMA_REGION17_HIGH    0x000FFFFFU
#define TEE_DMA_REGION17_HIGH_M  (TEE_DMA_REGION17_HIGH_V << TEE_DMA_REGION17_HIGH_S)
#define TEE_DMA_REGION17_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION17_HIGH_S  12

/** TEE_DMA_REGION18_LOW_REG register
 *  Region18 address low register.
 */
#define TEE_DMA_REGION18_LOW_REG (DR_REG_TEE_DMA_BASE + 0x98)
/** TEE_DMA_REGION18_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region18 address low.
 */
#define TEE_DMA_REGION18_LOW    0x000FFFFFU
#define TEE_DMA_REGION18_LOW_M  (TEE_DMA_REGION18_LOW_V << TEE_DMA_REGION18_LOW_S)
#define TEE_DMA_REGION18_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION18_LOW_S  12

/** TEE_DMA_REGION18_HIGH_REG register
 *  Region18 address high register.
 */
#define TEE_DMA_REGION18_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x9c)
/** TEE_DMA_REGION18_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region18 address high.
 */
#define TEE_DMA_REGION18_HIGH    0x000FFFFFU
#define TEE_DMA_REGION18_HIGH_M  (TEE_DMA_REGION18_HIGH_V << TEE_DMA_REGION18_HIGH_S)
#define TEE_DMA_REGION18_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION18_HIGH_S  12

/** TEE_DMA_REGION19_LOW_REG register
 *  Region19 address low register.
 */
#define TEE_DMA_REGION19_LOW_REG (DR_REG_TEE_DMA_BASE + 0xa0)
/** TEE_DMA_REGION19_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region19 address low.
 */
#define TEE_DMA_REGION19_LOW    0x000FFFFFU
#define TEE_DMA_REGION19_LOW_M  (TEE_DMA_REGION19_LOW_V << TEE_DMA_REGION19_LOW_S)
#define TEE_DMA_REGION19_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION19_LOW_S  12

/** TEE_DMA_REGION19_HIGH_REG register
 *  Region19 address high register.
 */
#define TEE_DMA_REGION19_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xa4)
/** TEE_DMA_REGION19_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region19 address high.
 */
#define TEE_DMA_REGION19_HIGH    0x000FFFFFU
#define TEE_DMA_REGION19_HIGH_M  (TEE_DMA_REGION19_HIGH_V << TEE_DMA_REGION19_HIGH_S)
#define TEE_DMA_REGION19_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION19_HIGH_S  12

/** TEE_DMA_REGION20_LOW_REG register
 *  Region20 address low register.
 */
#define TEE_DMA_REGION20_LOW_REG (DR_REG_TEE_DMA_BASE + 0xa8)
/** TEE_DMA_REGION20_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region20 address low.
 */
#define TEE_DMA_REGION20_LOW    0x000FFFFFU
#define TEE_DMA_REGION20_LOW_M  (TEE_DMA_REGION20_LOW_V << TEE_DMA_REGION20_LOW_S)
#define TEE_DMA_REGION20_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION20_LOW_S  12

/** TEE_DMA_REGION20_HIGH_REG register
 *  Region20 address high register.
 */
#define TEE_DMA_REGION20_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xac)
/** TEE_DMA_REGION20_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region20 address high.
 */
#define TEE_DMA_REGION20_HIGH    0x000FFFFFU
#define TEE_DMA_REGION20_HIGH_M  (TEE_DMA_REGION20_HIGH_V << TEE_DMA_REGION20_HIGH_S)
#define TEE_DMA_REGION20_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION20_HIGH_S  12

/** TEE_DMA_REGION21_LOW_REG register
 *  Region21 address low register.
 */
#define TEE_DMA_REGION21_LOW_REG (DR_REG_TEE_DMA_BASE + 0xb0)
/** TEE_DMA_REGION21_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region21 address low.
 */
#define TEE_DMA_REGION21_LOW    0x000FFFFFU
#define TEE_DMA_REGION21_LOW_M  (TEE_DMA_REGION21_LOW_V << TEE_DMA_REGION21_LOW_S)
#define TEE_DMA_REGION21_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION21_LOW_S  12

/** TEE_DMA_REGION21_HIGH_REG register
 *  Region21 address high register.
 */
#define TEE_DMA_REGION21_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xb4)
/** TEE_DMA_REGION21_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region21 address high.
 */
#define TEE_DMA_REGION21_HIGH    0x000FFFFFU
#define TEE_DMA_REGION21_HIGH_M  (TEE_DMA_REGION21_HIGH_V << TEE_DMA_REGION21_HIGH_S)
#define TEE_DMA_REGION21_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION21_HIGH_S  12

/** TEE_DMA_REGION22_LOW_REG register
 *  Region22 address low register.
 */
#define TEE_DMA_REGION22_LOW_REG (DR_REG_TEE_DMA_BASE + 0xb8)
/** TEE_DMA_REGION22_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region22 address low.
 */
#define TEE_DMA_REGION22_LOW    0x000FFFFFU
#define TEE_DMA_REGION22_LOW_M  (TEE_DMA_REGION22_LOW_V << TEE_DMA_REGION22_LOW_S)
#define TEE_DMA_REGION22_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION22_LOW_S  12

/** TEE_DMA_REGION22_HIGH_REG register
 *  Region22 address high register.
 */
#define TEE_DMA_REGION22_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xbc)
/** TEE_DMA_REGION22_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region22 address high.
 */
#define TEE_DMA_REGION22_HIGH    0x000FFFFFU
#define TEE_DMA_REGION22_HIGH_M  (TEE_DMA_REGION22_HIGH_V << TEE_DMA_REGION22_HIGH_S)
#define TEE_DMA_REGION22_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION22_HIGH_S  12

/** TEE_DMA_REGION23_LOW_REG register
 *  Region23 address low register.
 */
#define TEE_DMA_REGION23_LOW_REG (DR_REG_TEE_DMA_BASE + 0xc0)
/** TEE_DMA_REGION23_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region23 address low.
 */
#define TEE_DMA_REGION23_LOW    0x000FFFFFU
#define TEE_DMA_REGION23_LOW_M  (TEE_DMA_REGION23_LOW_V << TEE_DMA_REGION23_LOW_S)
#define TEE_DMA_REGION23_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION23_LOW_S  12

