espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_REGION23_HIGH_REG register
 *  Region23 address high register.
 */
#define TEE_DMA_REGION23_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xc4)
/** TEE_DMA_REGION23_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region23 address high.
 */
#define TEE_DMA_REGION23_HIGH    0x000FFFFFU
#define TEE_DMA_REGION23_HIGH_M  (TEE_DMA_REGION23_HIGH_V << TEE_DMA_REGION23_HIGH_S)
#define TEE_DMA_REGION23_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION23_HIGH_S  12

/** TEE_DMA_REGION24_LOW_REG register
 *  Region24 address low register.
 */
#define TEE_DMA_REGION24_LOW_REG (DR_REG_TEE_DMA_BASE + 0xc8)
/** TEE_DMA_REGION24_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region24 address low.
 */
#define TEE_DMA_REGION24_LOW    0x000FFFFFU
#define TEE_DMA_REGION24_LOW_M  (TEE_DMA_REGION24_LOW_V << TEE_DMA_REGION24_LOW_S)
#define TEE_DMA_REGION24_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION24_LOW_S  12

/** TEE_DMA_REGION24_HIGH_REG register
 *  Region24 address high register.
 */
#define TEE_DMA_REGION24_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xcc)
/** TEE_DMA_REGION24_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region24 address high.
 */
#define TEE_DMA_REGION24_HIGH    0x000FFFFFU
#define TEE_DMA_REGION24_HIGH_M  (TEE_DMA_REGION24_HIGH_V << TEE_DMA_REGION24_HIGH_S)
#define TEE_DMA_REGION24_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION24_HIGH_S  12

/** TEE_DMA_REGION25_LOW_REG register
 *  Region25 address low register.
 */
#define TEE_DMA_REGION25_LOW_REG (DR_REG_TEE_DMA_BASE + 0xd0)
/** TEE_DMA_REGION25_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region25 address low.
 */
#define TEE_DMA_REGION25_LOW    0x000FFFFFU
#define TEE_DMA_REGION25_LOW_M  (TEE_DMA_REGION25_LOW_V << TEE_DMA_REGION25_LOW_S)
#define TEE_DMA_REGION25_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION25_LOW_S  12

/** TEE_DMA_REGION25_HIGH_REG register
 *  Region25 address high register.
 */
#define TEE_DMA_REGION25_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xd4)
/** TEE_DMA_REGION25_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region25 address high.
 */
#define TEE_DMA_REGION25_HIGH    0x000FFFFFU
#define TEE_DMA_REGION25_HIGH_M  (TEE_DMA_REGION25_HIGH_V << TEE_DMA_REGION25_HIGH_S)
#define TEE_DMA_REGION25_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION25_HIGH_S  12

/** TEE_DMA_REGION26_LOW_REG register
 *  Region26 address low register.
 */
#define TEE_DMA_REGION26_LOW_REG (DR_REG_TEE_DMA_BASE + 0xd8)
/** TEE_DMA_REGION26_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region26 address low.
 */
#define TEE_DMA_REGION26_LOW    0x000FFFFFU
#define TEE_DMA_REGION26_LOW_M  (TEE_DMA_REGION26_LOW_V << TEE_DMA_REGION26_LOW_S)
#define TEE_DMA_REGION26_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION26_LOW_S  12

/** TEE_DMA_REGION26_HIGH_REG register
 *  Region26 address high register.
 */
#define TEE_DMA_REGION26_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xdc)
/** TEE_DMA_REGION26_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region26 address high.
 */
#define TEE_DMA_REGION26_HIGH    0x000FFFFFU
#define TEE_DMA_REGION26_HIGH_M  (TEE_DMA_REGION26_HIGH_V << TEE_DMA_REGION26_HIGH_S)
#define TEE_DMA_REGION26_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION26_HIGH_S  12

/** TEE_DMA_REGION27_LOW_REG register
 *  Region27 address low register.
 */
#define TEE_DMA_REGION27_LOW_REG (DR_REG_TEE_DMA_BASE + 0xe0)
/** TEE_DMA_REGION27_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region27 address low.
 */
#define TEE_DMA_REGION27_LOW    0x000FFFFFU
#define TEE_DMA_REGION27_LOW_M  (TEE_DMA_REGION27_LOW_V << TEE_DMA_REGION27_LOW_S)
#define TEE_DMA_REGION27_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION27_LOW_S  12

/** TEE_DMA_REGION27_HIGH_REG register
 *  Region27 address high register.
 */
#define TEE_DMA_REGION27_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xe4)
/** TEE_DMA_REGION27_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region27 address high.
 */
#define TEE_DMA_REGION27_HIGH    0x000FFFFFU
#define TEE_DMA_REGION27_HIGH_M  (TEE_DMA_REGION27_HIGH_V << TEE_DMA_REGION27_HIGH_S)
#define TEE_DMA_REGION27_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION27_HIGH_S  12

/** TEE_DMA_REGION28_LOW_REG register
 *  Region28 address low register.
 */
#define TEE_DMA_REGION28_LOW_REG (DR_REG_TEE_DMA_BASE + 0xe8)
/** TEE_DMA_REGION28_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region28 address low.
 */
#define TEE_DMA_REGION28_LOW    0x000FFFFFU
#define TEE_DMA_REGION28_LOW_M  (TEE_DMA_REGION28_LOW_V << TEE_DMA_REGION28_LOW_S)
#define TEE_DMA_REGION28_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION28_LOW_S  12

/** TEE_DMA_REGION28_HIGH_REG register
 *  Region28 address high register.
 */
#define TEE_DMA_REGION28_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xec)
/** TEE_DMA_REGION28_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region28 address high.
 */
#define TEE_DMA_REGION28_HIGH    0x000FFFFFU
#define TEE_DMA_REGION28_HIGH_M  (TEE_DMA_REGION28_HIGH_V << TEE_DMA_REGION28_HIGH_S)
#define TEE_DMA_REGION28_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION28_HIGH_S  12

/** TEE_DMA_REGION29_LOW_REG register
 *  Region29 address low register.
 */
#define TEE_DMA_REGION29_LOW_REG (DR_REG_TEE_DMA_BASE + 0xf0)
/** TEE_DMA_REGION29_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region29 address low.
 */
#define TEE_DMA_REGION29_LOW    0x000FFFFFU
#define TEE_DMA_REGION29_LOW_M  (TEE_DMA_REGION29_LOW_V << TEE_DMA_REGION29_LOW_S)
#define TEE_DMA_REGION29_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION29_LOW_S  12

/** TEE_DMA_REGION29_HIGH_REG register
 *  Region29 address high register.
 */
#define TEE_DMA_REGION29_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xf4)
/** TEE_DMA_REGION29_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region29 address high.
 */
#define TEE_DMA_REGION29_HIGH    0x000FFFFFU
#define TEE_DMA_REGION29_HIGH_M  (TEE_DMA_REGION29_HIGH_V << TEE_DMA_REGION29_HIGH_S)
#define TEE_DMA_REGION29_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION29_HIGH_S  12

/** TEE_DMA_REGION30_LOW_REG register
 *  Region30 address low register.
 */
#define TEE_DMA_REGION30_LOW_REG (DR_REG_TEE_DMA_BASE + 0xf8)
/** TEE_DMA_REGION30_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region30 address low.
 */
#define TEE_DMA_REGION30_LOW    0x000FFFFFU
#define TEE_DMA_REGION30_LOW_M  (TEE_DMA_REGION30_LOW_V << TEE_DMA_REGION30_LOW_S)
#define TEE_DMA_REGION30_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION30_LOW_S  12

/** TEE_DMA_REGION30_HIGH_REG register
 *  Region30 address high register.
 */
#define TEE_DMA_REGION30_HIGH_REG (DR_REG_TEE_DMA_BASE + 0xfc)
/** TEE_DMA_REGION30_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region30 address high.
 */
#define TEE_DMA_REGION30_HIGH    0x000FFFFFU
#define TEE_DMA_REGION30_HIGH_M  (TEE_DMA_REGION30_HIGH_V << TEE_DMA_REGION30_HIGH_S)
#define TEE_DMA_REGION30_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION30_HIGH_S  12

