espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_REGION31_LOW_REG register
 *  Region31 address low register.
 */
#define TEE_DMA_REGION31_LOW_REG (DR_REG_TEE_DMA_BASE + 0x100)
/** TEE_DMA_REGION31_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Region31 address low.
 */
#define TEE_DMA_REGION31_LOW    0x000FFFFFU
#define TEE_DMA_REGION31_LOW_M  (TEE_DMA_REGION31_LOW_V << TEE_DMA_REGION31_LOW_S)
#define TEE_DMA_REGION31_LOW_V  0x000FFFFFU
#define TEE_DMA_REGION31_LOW_S  12

/** TEE_DMA_REGION31_HIGH_REG register
 *  Region31 address high register.
 */
#define TEE_DMA_REGION31_HIGH_REG (DR_REG_TEE_DMA_BASE + 0x104)
/** TEE_DMA_REGION31_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Region31 address high.
 */
#define TEE_DMA_REGION31_HIGH    0x000FFFFFU
#define TEE_DMA_REGION31_HIGH_M  (TEE_DMA_REGION31_HIGH_V << TEE_DMA_REGION31_HIGH_S)
#define TEE_DMA_REGION31_HIGH_V  0x000FFFFFU
#define TEE_DMA_REGION31_HIGH_S  12

/** TEE_DMA_GMDA_CH0_R_PMS_REG register
 *  GDMA ch0 read permission control registers.
 */
#define TEE_DMA_GMDA_CH0_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x108)
/** TEE_DMA_GDMA_CH0_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch0 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH0_R_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH0_R_PMS_M  (TEE_DMA_GDMA_CH0_R_PMS_V << TEE_DMA_GDMA_CH0_R_PMS_S)
#define TEE_DMA_GDMA_CH0_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH0_R_PMS_S  0

/** TEE_DMA_GMDA_CH0_W_PMS_REG register
 *  GDMA ch0 write permission control registers.
 */
#define TEE_DMA_GMDA_CH0_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x10c)
/** TEE_DMA_GDMA_CH0_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch0 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH0_W_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH0_W_PMS_M  (TEE_DMA_GDMA_CH0_W_PMS_V << TEE_DMA_GDMA_CH0_W_PMS_S)
#define TEE_DMA_GDMA_CH0_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH0_W_PMS_S  0

/** TEE_DMA_GMDA_CH1_R_PMS_REG register
 *  GDMA ch1 read permission control registers.
 */
#define TEE_DMA_GMDA_CH1_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x110)
/** TEE_DMA_GDMA_CH1_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch1 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH1_R_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH1_R_PMS_M  (TEE_DMA_GDMA_CH1_R_PMS_V << TEE_DMA_GDMA_CH1_R_PMS_S)
#define TEE_DMA_GDMA_CH1_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH1_R_PMS_S  0

/** TEE_DMA_GMDA_CH1_W_PMS_REG register
 *  GDMA ch1 write permission control registers.
 */
#define TEE_DMA_GMDA_CH1_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x114)
/** TEE_DMA_GDMA_CH1_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch1 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH1_W_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH1_W_PMS_M  (TEE_DMA_GDMA_CH1_W_PMS_V << TEE_DMA_GDMA_CH1_W_PMS_S)
#define TEE_DMA_GDMA_CH1_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH1_W_PMS_S  0

/** TEE_DMA_GMDA_CH2_R_PMS_REG register
 *  GDMA ch2 read permission control registers.
 */
#define TEE_DMA_GMDA_CH2_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x118)
/** TEE_DMA_GDMA_CH2_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch2 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH2_R_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH2_R_PMS_M  (TEE_DMA_GDMA_CH2_R_PMS_V << TEE_DMA_GDMA_CH2_R_PMS_S)
#define TEE_DMA_GDMA_CH2_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH2_R_PMS_S  0

/** TEE_DMA_GMDA_CH2_W_PMS_REG register
 *  GDMA ch2 write permission control registers.
 */
#define TEE_DMA_GMDA_CH2_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x11c)
/** TEE_DMA_GDMA_CH2_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch2 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH2_W_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH2_W_PMS_M  (TEE_DMA_GDMA_CH2_W_PMS_V << TEE_DMA_GDMA_CH2_W_PMS_S)
#define TEE_DMA_GDMA_CH2_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH2_W_PMS_S  0

/** TEE_DMA_GMDA_CH3_R_PMS_REG register
 *  GDMA ch3 read permission control registers.
 */
#define TEE_DMA_GMDA_CH3_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x120)
/** TEE_DMA_GDMA_CH3_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch3 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH3_R_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH3_R_PMS_M  (TEE_DMA_GDMA_CH3_R_PMS_V << TEE_DMA_GDMA_CH3_R_PMS_S)
#define TEE_DMA_GDMA_CH3_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH3_R_PMS_S  0

/** TEE_DMA_GMDA_CH3_W_PMS_REG register
 *  GDMA ch3 write permission control registers.
 */
#define TEE_DMA_GMDA_CH3_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x124)
/** TEE_DMA_GDMA_CH3_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GDMA ch3 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GDMA_CH3_W_PMS    0xFFFFFFFFU
#define TEE_DMA_GDMA_CH3_W_PMS_M  (TEE_DMA_GDMA_CH3_W_PMS_V << TEE_DMA_GDMA_CH3_W_PMS_S)
#define TEE_DMA_GDMA_CH3_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GDMA_CH3_W_PMS_S  0

/** TEE_DMA_AHB_PDMA_ADC_R_PMS_REG register
 *  AHB PDMA adc read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_ADC_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x128)
/** TEE_DMA_AHB_PDMA_ADC_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA adc read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_ADC_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_ADC_R_PMS_M  (TEE_DMA_AHB_PDMA_ADC_R_PMS_V << TEE_DMA_AHB_PDMA_ADC_R_PMS_S)
#define TEE_DMA_AHB_PDMA_ADC_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_ADC_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_ADC_W_PMS_REG register
 *  AHB PDMA adc write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_ADC_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x12c)
/** TEE_DMA_AHB_PDMA_ADC_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA adc write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_ADC_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_ADC_W_PMS_M  (TEE_DMA_AHB_PDMA_ADC_W_PMS_V << TEE_DMA_AHB_PDMA_ADC_W_PMS_S)
#define TEE_DMA_AHB_PDMA_ADC_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_ADC_W_PMS_S  0

/** TEE_DMA_AHB_PDMA_I2S0_R_PMS_REG register
 *  AHB PDMA i2s0 read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I2S0_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x130)
/** TEE_DMA_AHB_PDMA_I2S0_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i2s0 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I2S0_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S0_R_PMS_M  (TEE_DMA_AHB_PDMA_I2S0_R_PMS_V << TEE_DMA_AHB_PDMA_I2S0_R_PMS_S)
#define TEE_DMA_AHB_PDMA_I2S0_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S0_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_I2S0_W_PMS_REG register
 *  AHB PDMA i2s0 write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I2S0_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x134)
/** TEE_DMA_AHB_PDMA_I2S0_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i2s0 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I2S0_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S0_W_PMS_M  (TEE_DMA_AHB_PDMA_I2S0_W_PMS_V << TEE_DMA_AHB_PDMA_I2S0_W_PMS_S)
#define TEE_DMA_AHB_PDMA_I2S0_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S0_W_PMS_S  0

