espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_AHB_PDMA_I2S1_R_PMS_REG register
 *  AHB PDMA i2s1 read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I2S1_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x138)
/** TEE_DMA_AHB_PDMA_I2S1_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i2s1 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I2S1_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S1_R_PMS_M  (TEE_DMA_AHB_PDMA_I2S1_R_PMS_V << TEE_DMA_AHB_PDMA_I2S1_R_PMS_S)
#define TEE_DMA_AHB_PDMA_I2S1_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S1_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_I2S1_W_PMS_REG register
 *  AHB PDMA i2s1 write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I2S1_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x13c)
/** TEE_DMA_AHB_PDMA_I2S1_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i2s1 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I2S1_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S1_W_PMS_M  (TEE_DMA_AHB_PDMA_I2S1_W_PMS_V << TEE_DMA_AHB_PDMA_I2S1_W_PMS_S)
#define TEE_DMA_AHB_PDMA_I2S1_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S1_W_PMS_S  0

/** TEE_DMA_AHB_PDMA_I2S2_R_PMS_REG register
 *  AHB PDMA i2s2 read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I2S2_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x140)
/** TEE_DMA_AHB_PDMA_I2S2_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i2s2 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I2S2_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S2_R_PMS_M  (TEE_DMA_AHB_PDMA_I2S2_R_PMS_V << TEE_DMA_AHB_PDMA_I2S2_R_PMS_S)
#define TEE_DMA_AHB_PDMA_I2S2_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S2_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_I2S2_W_PMS_REG register
 *  AHB PDMA i2s2 write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I2S2_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x144)
/** TEE_DMA_AHB_PDMA_I2S2_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i2s2 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I2S2_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S2_W_PMS_M  (TEE_DMA_AHB_PDMA_I2S2_W_PMS_V << TEE_DMA_AHB_PDMA_I2S2_W_PMS_S)
#define TEE_DMA_AHB_PDMA_I2S2_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I2S2_W_PMS_S  0

/** TEE_DMA_AHB_PDMA_I3C_MST_R_PMS_REG register
 *  AHB PDMA i3s mst read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I3C_MST_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x148)
/** TEE_DMA_AHB_PDMA_I3C_MST_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i3c mst read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I3C_MST_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I3C_MST_R_PMS_M  (TEE_DMA_AHB_PDMA_I3C_MST_R_PMS_V << TEE_DMA_AHB_PDMA_I3C_MST_R_PMS_S)
#define TEE_DMA_AHB_PDMA_I3C_MST_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I3C_MST_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_I3C_MST_W_PMS_REG register
 *  AHB PDMA i3c mst  write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_I3C_MST_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x14c)
/** TEE_DMA_AHB_PDMA_I3C_MST_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA i3c mst  write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_I3C_MST_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I3C_MST_W_PMS_M  (TEE_DMA_AHB_PDMA_I3C_MST_W_PMS_V << TEE_DMA_AHB_PDMA_I3C_MST_W_PMS_S)
#define TEE_DMA_AHB_PDMA_I3C_MST_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_I3C_MST_W_PMS_S  0

/** TEE_DMA_AHB_PDMA_UHCI0_R_PMS_REG register
 *  AHB PDMA uhci0 read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_UHCI0_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x150)
/** TEE_DMA_AHB_PDMA_UHCI0_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA uhci0 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_UHCI0_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_UHCI0_R_PMS_M  (TEE_DMA_AHB_PDMA_UHCI0_R_PMS_V << TEE_DMA_AHB_PDMA_UHCI0_R_PMS_S)
#define TEE_DMA_AHB_PDMA_UHCI0_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_UHCI0_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_UHCI0_W_PMS_REG register
 *  AHB PDMA uhci0 write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_UHCI0_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x154)
/** TEE_DMA_AHB_PDMA_UHCI0_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA uhci0 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_UHCI0_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_UHCI0_W_PMS_M  (TEE_DMA_AHB_PDMA_UHCI0_W_PMS_V << TEE_DMA_AHB_PDMA_UHCI0_W_PMS_S)
#define TEE_DMA_AHB_PDMA_UHCI0_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_UHCI0_W_PMS_S  0

/** TEE_DMA_AHB_PDMA_RMT_R_PMS_REG register
 *  AHB PDMA rmt read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_RMT_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x158)
/** TEE_DMA_AHB_PDMA_RMT_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA rmt read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_RMT_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_RMT_R_PMS_M  (TEE_DMA_AHB_PDMA_RMT_R_PMS_V << TEE_DMA_AHB_PDMA_RMT_R_PMS_S)
#define TEE_DMA_AHB_PDMA_RMT_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_RMT_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_RMT_W_PMS_REG register
 *  AHB PDMA rmt write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_RMT_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x170)
/** TEE_DMA_AHB_PDMA_RMT_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA rmt write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_RMT_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_RMT_W_PMS_M  (TEE_DMA_AHB_PDMA_RMT_W_PMS_V << TEE_DMA_AHB_PDMA_RMT_W_PMS_S)
#define TEE_DMA_AHB_PDMA_RMT_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_RMT_W_PMS_S  0

/** TEE_DMA_AXI_PDMA_LCDCAM_R_PMS_REG register
 *  AXI PDMA lcdcam read permission control registers.
 */
#define TEE_DMA_AXI_PDMA_LCDCAM_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x174)
/** TEE_DMA_AXI_PDMA_LCDCAM_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA lcdcam read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_LCDCAM_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_LCDCAM_R_PMS_M  (TEE_DMA_AXI_PDMA_LCDCAM_R_PMS_V << TEE_DMA_AXI_PDMA_LCDCAM_R_PMS_S)
#define TEE_DMA_AXI_PDMA_LCDCAM_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_LCDCAM_R_PMS_S  0

