espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_AXI_PDMA_LCDCAM_W_PMS_REG register
 *  AXI PDMA lcdcam write permission control registers.
 */
#define TEE_DMA_AXI_PDMA_LCDCAM_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x178)
/** TEE_DMA_AXI_PDMA_LCDCAM_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA lcdcam write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_LCDCAM_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_LCDCAM_W_PMS_M  (TEE_DMA_AXI_PDMA_LCDCAM_W_PMS_V << TEE_DMA_AXI_PDMA_LCDCAM_W_PMS_S)
#define TEE_DMA_AXI_PDMA_LCDCAM_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_LCDCAM_W_PMS_S  0

/** TEE_DMA_AXI_PDMA_GPSPI2_R_PMS_REG register
 *  AXI PDMA gpspi2 read permission control registers.
 */
#define TEE_DMA_AXI_PDMA_GPSPI2_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x17c)
/** TEE_DMA_AXI_PDMA_GPSPI2_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA gpspi2 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_GPSPI2_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI2_R_PMS_M  (TEE_DMA_AXI_PDMA_GPSPI2_R_PMS_V << TEE_DMA_AXI_PDMA_GPSPI2_R_PMS_S)
#define TEE_DMA_AXI_PDMA_GPSPI2_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI2_R_PMS_S  0

/** TEE_DMA_AXI_PDMA_GPSPI2_W_PMS_REG register
 *  AXI PDMA gpspi2 write permission control registers.
 */
#define TEE_DMA_AXI_PDMA_GPSPI2_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x180)
/** TEE_DMA_AXI_PDMA_GPSPI2_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA gpspi2 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_GPSPI2_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI2_W_PMS_M  (TEE_DMA_AXI_PDMA_GPSPI2_W_PMS_V << TEE_DMA_AXI_PDMA_GPSPI2_W_PMS_S)
#define TEE_DMA_AXI_PDMA_GPSPI2_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI2_W_PMS_S  0

/** TEE_DMA_AXI_PDMA_GPSPI3_R_PMS_REG register
 *  AXI PDMA gpspi3 read permission control registers.
 */
#define TEE_DMA_AXI_PDMA_GPSPI3_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x184)
/** TEE_DMA_AXI_PDMA_GPSPI3_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA gpspi3 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_GPSPI3_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI3_R_PMS_M  (TEE_DMA_AXI_PDMA_GPSPI3_R_PMS_V << TEE_DMA_AXI_PDMA_GPSPI3_R_PMS_S)
#define TEE_DMA_AXI_PDMA_GPSPI3_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI3_R_PMS_S  0

/** TEE_DMA_AXI_PDMA_GPSPI3_W_PMS_REG register
 *  AXI PDMA gpspi3 write permission control registers.
 */
#define TEE_DMA_AXI_PDMA_GPSPI3_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x188)
/** TEE_DMA_AXI_PDMA_GPSPI3_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA gpspi3 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_GPSPI3_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI3_W_PMS_M  (TEE_DMA_AXI_PDMA_GPSPI3_W_PMS_V << TEE_DMA_AXI_PDMA_GPSPI3_W_PMS_S)
#define TEE_DMA_AXI_PDMA_GPSPI3_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_GPSPI3_W_PMS_S  0

/** TEE_DMA_AXI_PDMA_PARLIO_R_PMS_REG register
 *  AXI PDMA parl io read permission control registers.
 */
#define TEE_DMA_AXI_PDMA_PARLIO_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x18c)
/** TEE_DMA_AXI_PDMA_PARLIO_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA parl io read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_PARLIO_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_PARLIO_R_PMS_M  (TEE_DMA_AXI_PDMA_PARLIO_R_PMS_V << TEE_DMA_AXI_PDMA_PARLIO_R_PMS_S)
#define TEE_DMA_AXI_PDMA_PARLIO_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_PARLIO_R_PMS_S  0

/** TEE_DMA_AXI_PDMA_PARLIO_W_PMS_REG register
 *  AXI PDMA parl io write permission control registers.
 */
#define TEE_DMA_AXI_PDMA_PARLIO_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x190)
/** TEE_DMA_AXI_PDMA_PARLIO_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA parl io write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_PARLIO_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_PARLIO_W_PMS_M  (TEE_DMA_AXI_PDMA_PARLIO_W_PMS_V << TEE_DMA_AXI_PDMA_PARLIO_W_PMS_S)
#define TEE_DMA_AXI_PDMA_PARLIO_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_PARLIO_W_PMS_S  0

/** TEE_DMA_AXI_PDMA_AES_R_PMS_REG register
 *  AXI PDMA aes read permission control registers.
 */
#define TEE_DMA_AXI_PDMA_AES_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x194)
/** TEE_DMA_AXI_PDMA_AES_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA aes read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_AES_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_AES_R_PMS_M  (TEE_DMA_AXI_PDMA_AES_R_PMS_V << TEE_DMA_AXI_PDMA_AES_R_PMS_S)
#define TEE_DMA_AXI_PDMA_AES_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_AES_R_PMS_S  0

/** TEE_DMA_AXI_PDMA_AES_W_PMS_REG register
 *  AXI PDMA aes write permission control registers.
 */
#define TEE_DMA_AXI_PDMA_AES_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x198)
/** TEE_DMA_AXI_PDMA_AES_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA aes write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_AES_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_AES_W_PMS_M  (TEE_DMA_AXI_PDMA_AES_W_PMS_V << TEE_DMA_AXI_PDMA_AES_W_PMS_S)
#define TEE_DMA_AXI_PDMA_AES_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_AES_W_PMS_S  0

/** TEE_DMA_AXI_PDMA_SHA_R_PMS_REG register
 *  AXI PDMA sha read permission control registers.
 */
#define TEE_DMA_AXI_PDMA_SHA_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x19c)
/** TEE_DMA_AXI_PDMA_SHA_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA sha read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_SHA_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_SHA_R_PMS_M  (TEE_DMA_AXI_PDMA_SHA_R_PMS_V << TEE_DMA_AXI_PDMA_SHA_R_PMS_S)
#define TEE_DMA_AXI_PDMA_SHA_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_SHA_R_PMS_S  0

/** TEE_DMA_AXI_PDMA_SHA_W_PMS_REG register
 *  AXI PDMA sha write permission control registers.
 */
#define TEE_DMA_AXI_PDMA_SHA_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x1a0)
/** TEE_DMA_AXI_PDMA_SHA_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA sha write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_SHA_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_SHA_W_PMS_M  (TEE_DMA_AXI_PDMA_SHA_W_PMS_V << TEE_DMA_AXI_PDMA_SHA_W_PMS_S)
#define TEE_DMA_AXI_PDMA_SHA_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_SHA_W_PMS_S  0

/** TEE_DMA_DMA2D_JPEG_PMS_R_REG register
 *  DMA2D JPEG read permission control registers.
 */
#define TEE_DMA_DMA2D_JPEG_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1a4)
/** TEE_DMA_DMA2D_JPEG_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  DMA2D JPEG read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_DMA2D_JPEG_R_PMS    0xFFFFFFFFU
#define TEE_DMA_DMA2D_JPEG_R_PMS_M  (TEE_DMA_DMA2D_JPEG_R_PMS_V << TEE_DMA_DMA2D_JPEG_R_PMS_S)
#define TEE_DMA_DMA2D_JPEG_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_DMA2D_JPEG_R_PMS_S  0

/** TEE_DMA_DMA2D_JPEG_PMS_W_REG register
 *  DMA2D JPEG write permission control registers.
 */
#define TEE_DMA_DMA2D_JPEG_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1a8)
/** TEE_DMA_DMA2D_JPEG_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  DMA2D  JPEG write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_DMA2D_JPEG_W_PMS    0xFFFFFFFFU
#define TEE_DMA_DMA2D_JPEG_W_PMS_M  (TEE_DMA_DMA2D_JPEG_W_PMS_V << TEE_DMA_DMA2D_JPEG_W_PMS_S)
#define TEE_DMA_DMA2D_JPEG_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_DMA2D_JPEG_W_PMS_S  0

/** TEE_DMA_USB_PMS_R_REG register
 *  USB read permission control registers.
 */
#define TEE_DMA_USB_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1ac)
/** TEE_DMA_USB_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  USB read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_USB_R_PMS    0xFFFFFFFFU
#define TEE_DMA_USB_R_PMS_M  (TEE_DMA_USB_R_PMS_V << TEE_DMA_USB_R_PMS_S)
#define TEE_DMA_USB_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_USB_R_PMS_S  0

/** TEE_DMA_USB_PMS_W_REG register
 *  USB write permission control registers.
 */
#define TEE_DMA_USB_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1b0)
/** TEE_DMA_USB_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  USB write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_USB_W_PMS    0xFFFFFFFFU
#define TEE_DMA_USB_W_PMS_M  (TEE_DMA_USB_W_PMS_V << TEE_DMA_USB_W_PMS_S)
#define TEE_DMA_USB_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_USB_W_PMS_S  0

/** TEE_DMA_GMAC_PMS_R_REG register
 *  GMAC read permission control registers.
 */
#define TEE_DMA_GMAC_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1b4)
/** TEE_DMA_GMAC_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GMAC read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GMAC_R_PMS    0xFFFFFFFFU
#define TEE_DMA_GMAC_R_PMS_M  (TEE_DMA_GMAC_R_PMS_V << TEE_DMA_GMAC_R_PMS_S)
#define TEE_DMA_GMAC_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GMAC_R_PMS_S  0

/** TEE_DMA_GMAC_PMS_W_REG register
 *  GMAC write permission control registers.
 */
#define TEE_DMA_GMAC_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1b8)
/** TEE_DMA_GMAC_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  GMAC write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_GMAC_W_PMS    0xFFFFFFFFU
#define TEE_DMA_GMAC_W_PMS_M  (TEE_DMA_GMAC_W_PMS_V << TEE_DMA_GMAC_W_PMS_S)
#define TEE_DMA_GMAC_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_GMAC_W_PMS_S  0

