espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_SDMMC_PMS_R_REG register
 *  SDMMC read permission control registers.
 */
#define TEE_DMA_SDMMC_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1bc)
/** TEE_DMA_SDMMC_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  SDMMC read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_SDMMC_R_PMS    0xFFFFFFFFU
#define TEE_DMA_SDMMC_R_PMS_M  (TEE_DMA_SDMMC_R_PMS_V << TEE_DMA_SDMMC_R_PMS_S)
#define TEE_DMA_SDMMC_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_SDMMC_R_PMS_S  0

/** TEE_DMA_SDMMC_PMS_W_REG register
 *  SDMMC write permission control registers.
 */
#define TEE_DMA_SDMMC_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1c0)
/** TEE_DMA_SDMMC_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  SDMMC write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_SDMMC_W_PMS    0xFFFFFFFFU
#define TEE_DMA_SDMMC_W_PMS_M  (TEE_DMA_SDMMC_W_PMS_V << TEE_DMA_SDMMC_W_PMS_S)
#define TEE_DMA_SDMMC_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_SDMMC_W_PMS_S  0

/** TEE_DMA_USBOTG11_PMS_R_REG register
 *  USBOTG11 read permission control registers.
 */
#define TEE_DMA_USBOTG11_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1c4)
/** TEE_DMA_USBOTG11_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  USBOTG11 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_USBOTG11_R_PMS    0xFFFFFFFFU
#define TEE_DMA_USBOTG11_R_PMS_M  (TEE_DMA_USBOTG11_R_PMS_V << TEE_DMA_USBOTG11_R_PMS_S)
#define TEE_DMA_USBOTG11_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_USBOTG11_R_PMS_S  0

/** TEE_DMA_USBOTG11_PMS_W_REG register
 *  USBOTG11 write permission control registers.
 */
#define TEE_DMA_USBOTG11_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1c8)
/** TEE_DMA_USBOTG11_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  USBOTG11 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_USBOTG11_W_PMS    0xFFFFFFFFU
#define TEE_DMA_USBOTG11_W_PMS_M  (TEE_DMA_USBOTG11_W_PMS_V << TEE_DMA_USBOTG11_W_PMS_S)
#define TEE_DMA_USBOTG11_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_USBOTG11_W_PMS_S  0

/** TEE_DMA_TRACE0_PMS_R_REG register
 *  TRACE0 read permission control registers.
 */
#define TEE_DMA_TRACE0_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1cc)
/** TEE_DMA_TRACE0_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  TRACE0 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_TRACE0_R_PMS    0xFFFFFFFFU
#define TEE_DMA_TRACE0_R_PMS_M  (TEE_DMA_TRACE0_R_PMS_V << TEE_DMA_TRACE0_R_PMS_S)
#define TEE_DMA_TRACE0_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_TRACE0_R_PMS_S  0

/** TEE_DMA_TRACE0_PMS_W_REG register
 *  TRACE0 write permission control registers.
 */
#define TEE_DMA_TRACE0_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1d0)
/** TEE_DMA_TRACE0_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  TRACE0 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_TRACE0_W_PMS    0xFFFFFFFFU
#define TEE_DMA_TRACE0_W_PMS_M  (TEE_DMA_TRACE0_W_PMS_V << TEE_DMA_TRACE0_W_PMS_S)
#define TEE_DMA_TRACE0_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_TRACE0_W_PMS_S  0

/** TEE_DMA_TRACE1_PMS_R_REG register
 *  TRACE1 read permission control registers.
 */
#define TEE_DMA_TRACE1_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1d4)
/** TEE_DMA_TRACE1_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  TRACE1 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_TRACE1_R_PMS    0xFFFFFFFFU
#define TEE_DMA_TRACE1_R_PMS_M  (TEE_DMA_TRACE1_R_PMS_V << TEE_DMA_TRACE1_R_PMS_S)
#define TEE_DMA_TRACE1_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_TRACE1_R_PMS_S  0

/** TEE_DMA_TRACE1_PMS_W_REG register
 *  TRACE1 write permission control registers.
 */
#define TEE_DMA_TRACE1_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1d8)
/** TEE_DMA_TRACE1_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  TRACE1 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_TRACE1_W_PMS    0xFFFFFFFFU
#define TEE_DMA_TRACE1_W_PMS_M  (TEE_DMA_TRACE1_W_PMS_V << TEE_DMA_TRACE1_W_PMS_S)
#define TEE_DMA_TRACE1_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_TRACE1_W_PMS_S  0

/** TEE_DMA_L2MEM_MON_PMS_R_REG register
 *  L2MEM MON read permission control registers.
 */
#define TEE_DMA_L2MEM_MON_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1dc)
/** TEE_DMA_L2MEM_MON_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  L2MEM MON read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_L2MEM_MON_R_PMS    0xFFFFFFFFU
#define TEE_DMA_L2MEM_MON_R_PMS_M  (TEE_DMA_L2MEM_MON_R_PMS_V << TEE_DMA_L2MEM_MON_R_PMS_S)
#define TEE_DMA_L2MEM_MON_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_L2MEM_MON_R_PMS_S  0

/** TEE_DMA_L2MEM_MON_PMS_W_REG register
 *  L2MEM MON write permission control registers.
 */
#define TEE_DMA_L2MEM_MON_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1e0)
/** TEE_DMA_L2MEM_MON_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  L2MEM MON write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_L2MEM_MON_W_PMS    0xFFFFFFFFU
#define TEE_DMA_L2MEM_MON_W_PMS_M  (TEE_DMA_L2MEM_MON_W_PMS_V << TEE_DMA_L2MEM_MON_W_PMS_S)
#define TEE_DMA_L2MEM_MON_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_L2MEM_MON_W_PMS_S  0

/** TEE_DMA_TCM_MON_PMS_R_REG register
 *  TCM MON read permission control registers.
 */
#define TEE_DMA_TCM_MON_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1e4)
/** TEE_DMA_TCM_MON_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  TCM MON read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_TCM_MON_R_PMS    0xFFFFFFFFU
#define TEE_DMA_TCM_MON_R_PMS_M  (TEE_DMA_TCM_MON_R_PMS_V << TEE_DMA_TCM_MON_R_PMS_S)
#define TEE_DMA_TCM_MON_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_TCM_MON_R_PMS_S  0

/** TEE_DMA_TCM_MON_PMS_W_REG register
 *  TCM MON write permission control registers.
 */
#define TEE_DMA_TCM_MON_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1e8)
/** TEE_DMA_TCM_MON_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  TCM MON write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_TCM_MON_W_PMS    0xFFFFFFFFU
#define TEE_DMA_TCM_MON_W_PMS_M  (TEE_DMA_TCM_MON_W_PMS_V << TEE_DMA_TCM_MON_W_PMS_S)
#define TEE_DMA_TCM_MON_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_TCM_MON_W_PMS_S  0

/** TEE_DMA_REGDMA_PMS_R_REG register
 *  REGDMA read permission control registers.
 */
#define TEE_DMA_REGDMA_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1ec)
/** TEE_DMA_REGDMA_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  REGDMA read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_REGDMA_R_PMS    0xFFFFFFFFU
#define TEE_DMA_REGDMA_R_PMS_M  (TEE_DMA_REGDMA_R_PMS_V << TEE_DMA_REGDMA_R_PMS_S)
#define TEE_DMA_REGDMA_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_REGDMA_R_PMS_S  0

/** TEE_DMA_REGDMA_PMS_W_REG register
 *  REGDMA write permission control registers.
 */
#define TEE_DMA_REGDMA_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x1f0)
/** TEE_DMA_REGDMA_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  REGDMA write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_REGDMA_W_PMS    0xFFFFFFFFU
#define TEE_DMA_REGDMA_W_PMS_M  (TEE_DMA_REGDMA_W_PMS_V << TEE_DMA_REGDMA_W_PMS_S)
#define TEE_DMA_REGDMA_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_REGDMA_W_PMS_S  0

/** TEE_DMA_H264_PMS_R_REG register
 *  H264 read permission control registers.
 */
#define TEE_DMA_H264_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x1fc)
/** TEE_DMA_H264_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  H264 read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_H264_R_PMS    0xFFFFFFFFU
#define TEE_DMA_H264_R_PMS_M  (TEE_DMA_H264_R_PMS_V << TEE_DMA_H264_R_PMS_S)
#define TEE_DMA_H264_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_H264_R_PMS_S  0

