espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_eco5_reg.h
/** TEE_DMA_H264_PMS_W_REG register
 *  H264 write permission control registers.
 */
#define TEE_DMA_H264_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x200)
/** TEE_DMA_H264_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  H264 write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_H264_W_PMS    0xFFFFFFFFU
#define TEE_DMA_H264_W_PMS_M  (TEE_DMA_H264_W_PMS_V << TEE_DMA_H264_W_PMS_S)
#define TEE_DMA_H264_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_H264_W_PMS_S  0

/** TEE_DMA_DMA2D_PPA_PMS_R_REG register
 *  DMA2D PPA read permission control registers.
 */
#define TEE_DMA_DMA2D_PPA_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x204)
/** TEE_DMA_DMA2D_PPA_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  DMA2D PPA  read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_DMA2D_PPA_R_PMS    0xFFFFFFFFU
#define TEE_DMA_DMA2D_PPA_R_PMS_M  (TEE_DMA_DMA2D_PPA_R_PMS_V << TEE_DMA_DMA2D_PPA_R_PMS_S)
#define TEE_DMA_DMA2D_PPA_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_DMA2D_PPA_R_PMS_S  0

/** TEE_DMA_DMA2D_PPA_PMS_W_REG register
 *  DMA2D PPA  write permission control registers.
 */
#define TEE_DMA_DMA2D_PPA_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x208)
/** TEE_DMA_DMA2D_PPA_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  DMA2D  PPA write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_DMA2D_PPA_W_PMS    0xFFFFFFFFU
#define TEE_DMA_DMA2D_PPA_W_PMS_M  (TEE_DMA_DMA2D_PPA_W_PMS_V << TEE_DMA_DMA2D_PPA_W_PMS_S)
#define TEE_DMA_DMA2D_PPA_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_DMA2D_PPA_W_PMS_S  0

/** TEE_DMA_DMA2D_DUMMY_PMS_R_REG register
 *  DMA2D dummy read permission control registers.
 */
#define TEE_DMA_DMA2D_DUMMY_PMS_R_REG (DR_REG_TEE_DMA_BASE + 0x20c)
/** TEE_DMA_DMA2D_DUMMY_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  DMA2D dummy  read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_DMA2D_DUMMY_R_PMS    0xFFFFFFFFU
#define TEE_DMA_DMA2D_DUMMY_R_PMS_M  (TEE_DMA_DMA2D_DUMMY_R_PMS_V << TEE_DMA_DMA2D_DUMMY_R_PMS_S)
#define TEE_DMA_DMA2D_DUMMY_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_DMA2D_DUMMY_R_PMS_S  0

/** TEE_DMA_DMA2D_DUMMY_PMS_W_REG register
 *  DMA2D dummy  write permission control registers.
 */
#define TEE_DMA_DMA2D_DUMMY_PMS_W_REG (DR_REG_TEE_DMA_BASE + 0x210)
/** TEE_DMA_DMA2D_DUMMY_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  DMA2D dummy  write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_DMA2D_DUMMY_W_PMS    0xFFFFFFFFU
#define TEE_DMA_DMA2D_DUMMY_W_PMS_M  (TEE_DMA_DMA2D_DUMMY_W_PMS_V << TEE_DMA_DMA2D_DUMMY_W_PMS_S)
#define TEE_DMA_DMA2D_DUMMY_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_DMA2D_DUMMY_W_PMS_S  0

/** TEE_DMA_AHB_PDMA_DUMMY_R_PMS_REG register
 *  AHB PDMA dummy read permission control registers.
 */
#define TEE_DMA_AHB_PDMA_DUMMY_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x214)
/** TEE_DMA_AHB_PDMA_DUMMY_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA dummy read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_DUMMY_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_DUMMY_R_PMS_M  (TEE_DMA_AHB_PDMA_DUMMY_R_PMS_V << TEE_DMA_AHB_PDMA_DUMMY_R_PMS_S)
#define TEE_DMA_AHB_PDMA_DUMMY_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_DUMMY_R_PMS_S  0

/** TEE_DMA_AHB_PDMA_DUMMY_W_PMS_REG register
 *  AHB PDMA dummy write permission control registers.
 */
#define TEE_DMA_AHB_PDMA_DUMMY_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x218)
/** TEE_DMA_AHB_PDMA_DUMMY_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AHB PDMA dummy write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AHB_PDMA_DUMMY_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_DUMMY_W_PMS_M  (TEE_DMA_AHB_PDMA_DUMMY_W_PMS_V << TEE_DMA_AHB_PDMA_DUMMY_W_PMS_S)
#define TEE_DMA_AHB_PDMA_DUMMY_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AHB_PDMA_DUMMY_W_PMS_S  0

/** TEE_DMA_AXI_PDMA_DUMMY_R_PMS_REG register
 *  AXI PDMA dummy read permission control registers.
 */
#define TEE_DMA_AXI_PDMA_DUMMY_R_PMS_REG (DR_REG_TEE_DMA_BASE + 0x21c)
/** TEE_DMA_AXI_PDMA_DUMMY_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA dummy read permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_DUMMY_R_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_DUMMY_R_PMS_M  (TEE_DMA_AXI_PDMA_DUMMY_R_PMS_V << TEE_DMA_AXI_PDMA_DUMMY_R_PMS_S)
#define TEE_DMA_AXI_PDMA_DUMMY_R_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_DUMMY_R_PMS_S  0

/** TEE_DMA_AXI_PDMA_DUMMY_W_PMS_REG register
 *  AXI PDMA dummy write permission control registers.
 */
#define TEE_DMA_AXI_PDMA_DUMMY_W_PMS_REG (DR_REG_TEE_DMA_BASE + 0x220)
/** TEE_DMA_AXI_PDMA_DUMMY_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI PDMA dummy write permission control, each bit corresponds to a region.
 */
#define TEE_DMA_AXI_PDMA_DUMMY_W_PMS    0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_DUMMY_W_PMS_M  (TEE_DMA_AXI_PDMA_DUMMY_W_PMS_V << TEE_DMA_AXI_PDMA_DUMMY_W_PMS_S)
#define TEE_DMA_AXI_PDMA_DUMMY_W_PMS_V  0xFFFFFFFFU
#define TEE_DMA_AXI_PDMA_DUMMY_W_PMS_S  0

#ifdef __cplusplus
}
#endif
